Repository: wvdakker/gtkterm
Catalog: po/*.po
Languages: ka, ru

source: ERROR: Buffer is not initialized!
ka: შეცდომა: ბუფერი ინიციალიზებული არაა!
ru: ОШИБКА: буфер не инициализирован!

source: GTKTerm version %s
ka: GTKTerm-ის ვერსია %s
ru: GTKTerm версии %s

source: This program is released under the terms of the GPL V.2
ka: ეს პროგრამა ვრცელდება ლიცენზიით GPL v2.
ru: Эта программа выпущена под лицензией GPL v.2

source: ** Use at your own risks! **
ka: ** მისი გამოყენებით რისკი თქვენზეა! **
ru: ** Используйте на свой риск! **

source: Command line options
ka: ბრძანების სტრიქონის პარამეტრები
ru: Параметры командной строки:

source: --help or -h: this help screen
ka: --help ან -h: ეს დახმარების ეკრანი
ru: --help или -h: это сообщение помощи

source: --config <configuration> or -c: load configuration
ka: --config <configuration> ან -c: კონფიგურაციის ჩატვირთვა
ru: --config <настройка> или -c: загрузка настройки

source: --port <device> or -p: serial port device (default /dev/ttyS0)
ka: --port <მოწყობილობა> ან -p: სერიული პორტის მოწყობილობა (ნაგულისხმევი /dev/ttyS0)
ru: --port <устройство> или -p: устройство последовательного порта (по умолчанию /dev/ttyS0)

source: --speed <speed> or -s: serial port speed (default 9600)
ka: --speed <სიჩქარე> ან -s: სერიული პორტის სიჩქარე (ნაგულისხმევი 9600)
ru: --speed <скорость> или -s: скорость последовательного порта (по умолчанию 9600)

source: --bits <bits> or -b: number of bits (default 8)
ka: --bits <ბიტები> ან -b: ბიტების რაოდენობა (ნაგულისხმევი 8)
ru: --bits <биты> или -b: количество бит (по умолчанию 8)

source: --stopbits <stopbits> or -t: number of stopbits (default 1)
ka: --stopbits <სტოპბიტები> ან -t: სტოპბიტების რაოდენობა (ნაგულისხმევია 1)
ru: --stopbits <стоп-бит> или -t: количество стоп-битов (по умолчанию 1)

source: --parity <odd | even> or -a: parity (default none)
ka: --parity <ლუწი | კენტი> ან -a: ტოლობა (ნაგულისხმევი: არცერთი)
ru: --parity <odd | even> или -a: проверка чётности (по умолчанию none)

source: --flow <Xon | RTS | RS485> or -w: flow control (default none)
ka: --flow <Xon | RTS | RS485> ან -w: დინების კონტროლი (ნაგულისხმევია: არცერთი)
ru: --flow <Xon | CTS | RS485> или -w: управление потоком (по умолчанию none)

source: --delay <ms> or -d: end of line delay in ms (default none)
ka: --delay <მწმ> ან -d: ხაზის დასრულების დაყოვნება მწმ-ში (ნაგულისხმევი: არცერთი)
ru: --delay <мс> или -d: задержка конца строки, мс (по умолчанию нет)

source: --char <char> or -r: wait for a special char at end of line (default none)
ka: --char <char> ან -r: სპეციალური სიმბოლოს დალოდება ხაზის ბოლოში (ნაგულისხმევი: არცერთი)
ru: --char <символ> или -r: ожидать специальный символ в конце строки (по умолчанию нет)

source: --file <filename> or -f: default file to send (default none)
ka: --file <ფაილისსახელი> ან -f: ნაგულისხმევი ფაილი გასაგზავნად (ნაგულისხმევი: არცერთი)
ru: --file <имя_файла> или -f: задать имя файла для отправки (по умолчанию нет)

source: --rts_time_before <ms> or -x: for RS-485, time in ms before transmit with rts on
ka: --rts_time_before <მწმ> ან -x: RS-485-ის დრო მწმ-ში გადაცემამდე, როცა rts ჩართულია
ru: --rts_time_before <ms> или -x: для RS-485 - время в мс перед передачей с включенным rts

source: --rts_time_after <ms> or -y: for RS-485, time in ms after transmit with rts on
ka: --rts_time_after <მწმ> ან -y: RS-485-ის დრო მწმ-ში გადაცემის შემდეგ, როცა rts ჩართულია
ru: --rts_time_after <ms> или -y: для RS-485 время в мс после передачи с включенным rts

source: --echo or -e: switch on local echo
ka: --echo ან -e: ლოკალური ექოს ჩართვა
ru: --echo или -e: включить локальный вывод

source: --disable-port-lock or -L: does not lock serial port. Allows to send to serial port from different terminals
ka: --disable-port-lock ან -L: სერიული პორტი არ დაიბლოკება. საშუალებას გაძლევთ, სერიულ პორტზე მონაცემები სხვადასხვა ტერმინალიდან გაგზავნოთ
ru: --disable-port-lock или -L: не блокирует последовательный порт. Позволяет отправлять данные на последовательный порт с разных терминалов

source: Note: incoming data are displayed randomly on only one terminal
ka: შენიშვნა: შემომავალი მონაცემები შემთხვევით, მხოლოდ, ერთ ტერმინალზეა ნაჩვენები
ru: Примечание: входящие данные отображаются случайным образом только на одном терминале

source: Undefined command line option
ka: უცნობი ბრძანების სტრიქონის პარამეტრი
ru: Неверный параметр командной строки

source: Send RAW File
ka: RAW ფაილის გაგზავნა
ru: Отправить RAW файл

source: Error opening file
ka: ფაილის გახსნის შეცდომა
ru: Ошибка открытия файла

source: %s: transfer in progress...
ka: %s: მიმდინარეობს გადაცემა...
ru: %s: выполняется передача...

source: Cancel
ka: გაუქმება
ru: Отмена

source: Cannot read file %s: %s
ka: წაკითხვის შეცდომა ფაილისთვის %s: %s
ru: Невозможно прочитать файл %s: %s

source: Error sending file
ka: ფაილის გაგზავნის შეცდომა
ru: Ошибка отправки файла

source: Error sending file: %s
ka: ფაილის გაგზავნის შეცდომა: %s
ru: Ошибка отправки файла: %s

source: Save RAW File
ka: RAW ფაილის გაგზავნა
ru: Сохранить RAW файл

source: File error
ka: ფაილის შეცდომა
ru: Ошибка файла

source: Cannot open file %s: %s
ka: ვერ გავხსენი ფაილი `%s': %s
ru: Невозможно открыть файл %s: %s

source: Save ASCII File
ka: ASCII ფაილის შენახვა

source: _File
ka: _ფაილი
ru: _Файл

source: _Edit
ka: _ჩასწორება
ru: _Редактировать

source: _Log
ka: ჟურნა_ლი
ru: _Лог

source: _Configuration
ka: _მორგება
ru: _Конфигурация

source: Control _signals
ka: კონტროლის _სიგნალები
ru: Сигналы _управления

source: _View
ka: _ხედი
ru: _Вид

source: Hexadecimal _chars
ka: თექვსმეტობითი სიმ_ბოლოები
ru: Шестнадцатеричные _символы

source: _Help
ka: _დახმარება
ru: _Помощь

source: _Clear screen
ka: ეკრა_ნის გასუფთავება
ru: _Очистить экран

source: _Clear scrollback
ka: გადახვევის გასუ_ფთავება
ru: _Очистить выдачу терминала

source: Send _RAW file
ka: _RAW ფაილის გაგზავნა
ru: Отправить _RAW файл

source: _Save RAW file
ka: RAW ფაილი_ს შენახვა
ru: _Сохранить RAW файл

source: Save _ASCII file
ka: ASCII ფ_აილის შენახვა

source: To file...
ka: ფაილში...
ru: Из файла...

source: _Port
ka: _პორტი
ru: _Порт

source: _Main window
ka: _მთავარი ფანჯარა
ru: _Главное окно

source: _Macros
ka: _მაკროები
ru: _Макрос

source: _Load configuration
ka: კონფიგურაციის _ჩატვირთვა
ru: _Загрузить конфигурацию

source: _Save configuration
ka: კონფიგურაციი_ს შენახვა
ru: _Сохранить конфигурацию

source: _Delete configuration
ka: კონფიგურაციის _წაშლა
ru: _Удалить конфигурацию

source: Send break
ka: შეწყვეტის გაგზავნა
ru: Отправить прерывание

source: _Open Port
ka: პ_ორტის გახსნა
ru: _Открыть порт

source: _Close Port
ka: _პორტის დახურვა
ru: _Закрыть порт

source: Toggle DTR
ka: DTR-ის გადართვა
ru: Переключатель DTR

source: Toggle RTS
ka: RTS-ის გადართვა
ru: Переключатель RTS

source: Local _echo
ka: ლოკალური _ექო
ru: Локальное _эхо

source: Autoreconnect
ka: ავტომატურად თავიდან დაკავშირება

source: _CR LF auto
ka: _CR LF ავტო
ru: _CR LF авто

source: ESC clear scree_n
ka: ESC ეკრა_ნის გასუფთავება

source: Timestamp
ka: დროის შტამპი
ru: Отметка времени

source: Show _index
ka: _ინდექსის ჩვენება
ru: Показать _индекс

source: _Send hexadecimal data
ka: თექვსმეტობითი მონაცემები_ს გაგზავნა
ru: _Отправить шестнадцатеричные данные

source: _Hexadecimal
ka: თ_ექვსმეტობითი
ru: _Шестнадцатеричный

source: Resume
ka: გაგრძელება
ru: Продолжить

source: Hexadecimal data to send (separator: ';' or space):
ka: თექვსმეტობითი მონაცემები გასაგზავნად (გამყოფი: ';', ან ჰარე):
ru: Шестнадцатеричные данные для отправки (разделитель: ';' или пробел):

source: GTKTerm is a simple GTK+ terminal used to communicate with the serial port.
ka: GTKTerm მარტივი GTK+-ის ტერმინალია სერიულ პორტთან კომუნიკაციისთვის.
ru: GTKTerm - это простой терминал GTK+, используемый для связи с последовательным портом.

source: Break signal sent!
ka: გაგზავნილია შეწყვეტის სიგნალი!
ru: Отправлен сигнал прерывания!

source: 0 byte(s) sent!
ka: გაგზავნილია 0 ბაიტი!
ru: Отправлено 0 байт!

source: Improper formatted hex input, 0 bytes sent!
ka: არასწორად დაფორმატებული თექვსმეტობითი შეყვანა. გაგზავნილია 0 ბაიტი!
ru: Неправильно отформатированный шестнадцатеричный ввод, отправлено 0 байт!

source: %d byte(s) sent!
ka: გაგზავნილია %d ბაიტი!
ru: %d байт отправлено!

source: Filename error
ka: ფაილის სახელის შეცდომა
ru: Ошибка названия файла

source: Log file selection
ka: ჟურნალის ფაილის არჩევანი
ru: Выбор файла журнала

source: Failed to log data
ka: მონაცემების ჟურნალში ჩაწერა ჩავარდა
ru: Не удалось записать данные

source: Macro "%s" sent!
ka: მაკრო "%s" გაიგზავნა!
ru: Макрос "%s" отправлен!

source: Shortcut
ka: მალსახმობი
ru: Комбинация клавиш

source: The "action" field of a macro is the data to be sent on the port. Text can be entered, but also special chars, like \n, \t, \r, etc. You can also enter hexadecimal data preceded by a '\'. The hexadecimal data should not begin with a letter (eg. use \0FF and not \FF) Examples: "Hello\n" sends "Hello" followed by a Line Feed "Hello\0A" does the same thing but the LF is entered in hexadecimal
ka: მაკროს ველი "ქმედება" წარმოადგენს მონაცემებს, რომლებიც პორტზე უნდა გაიგზავნოს. შეგიძლიათ შეიყვანოთ არა მხოლოდ ტექსტი, არამედ სპეციალური სიმბოლოებიც \n, \t, \r და ა.შ. ასევე შეგიძლიათ, შეიყვანოთ თექვსმეტობითი მონაცემები, რომლებიც '\'-ით იწყება. თექვსმეტობითი მონაცემები ასოთი არ უნდა იწყებოდეს (ანუ გამოიყენეთ \0FF, მაგრამ არა \FF) მაგ: "Hello"\n გააგზავნის სიტყვას "Hello", რომელსაც ხაზის გადატანა მოჰყვება "Hello"\0A გააკეთებს იგივეს, ოღონდ ხაზის გადატანა თექვსმეტობითშია მითითებული
ru: Поле "действие" макроса -- это данные отправляемые в порт. Может содержать текст и специальные символы, такие как \n, \t, \r и пр. Также можно вводить шестнадцатеричные данные после '\'. Шестнадцатеричные данные не должны начинаться с буквы (используйте \0FF вместо \FF) Примеры: "Hello\n" отправляет "Hello" и последующий символ новой строки "Hello\0A" делает тоже самое, но символ новой строки указан шестнадцатеричным кодом

source: Configure Macros
ka: მაკროების მორგება
ru: Настройка макросов

source: _Add
ka: დ_ამატება
ru: Доб_авить

source: _Delete
ka: _წაშლა
ru: У_далить

source: _Capture Shortcut
ka: მალსა_ხმობის მორგება
ru: _Захватить комбинацию клавиш

source: Cannot open configuration file `%s'.
ka: გახსნის შეცდომა კონფიგურაციის ფაილისთვის `%s'.
ru: Невозможно открыть файл настроек "%s".

source: Cannot create configuration file `%s'.
ka: შექმნის შეცდომა კონფიგურაციის ფაილისთვის `%s'.
ru: Невозможно создать файл настроек "%s".

source: %s(%d): %s Syntax error
ka: %s(%d): %s სინტაქსის შეცდომა
ru: %s(%d): %s Синтаксическая ошибка

source: %s(%d): %s Unrecognized parameter
ka: %s(%d): %s უცნობი პარამეტრი
ru: %s(%d): %s Нераспознанный параметр

source: %s(%d): %s Internal error
ka: %s(%d): %s შიდა შეცდომა
ru: %s(%d): %s Внутренняя ошибка

source: %s(%d): %s Invalid number
ka: %s(%d): %s არასწორი რიცხვი
ru: %s(%d): %s Неверный номер

source: %s(%d): %s Out of range
ka: %s(%d): %s შუალედს გარეტაა
ru: %s(%d): %s Вне диапазона

source: %s(%d): %s Cannot allocate memory.
ka: %s(%d): %s მეხსირების გამოყოფის შეცდომა.
ru: %s(%d): %s Невозможно выделить память.

source: %s(%d): %s It must be specified TRUE or FALSE.
ka: %s(%d): %s უნდა იყოს მითითებული ან TRUE, ან FALSE.
ru: %s(%d): %s Должно быть указано TRUE или FALSE.

source: %s(%d): %s The section name is already used.
ka: %s(%d): %s სექციის სახელი უკვე გამოიყენება.
ru: %s(%d): %s Название раздела уже используется.

source: %s(%d) There is no closing bracket.
ka: %s(%d) დამხურავი ფრჩხილის გარეშე.
ru: %s(%d) Нет закрывающей скобки.

source: %s(%d): %s Unexplained error
ka: %s(%d): %s აუხსნელი შეცდომა
ru: %s(%d): %s Необъяснимая ошибка

source: Cannot open %s: %s
ka: გახსნის შეცდომა: %s: %s
ru: Невозможно открыть %s: %s

source: Cannot lock port! The serial port may currently be in use by another program.
ka: პორტის დაბლოკვა შეუძლებელია! შეიძლება, სერიულ პორტს სხვა პროგრამა იყენებს.
ru: Не удается заблокировать порт! Возможно, последовательный порт в данный момент используется другой программой.

source: Arbitrary baud rates not supported
ka: შემთხვევითი ბოდური სიჩქარეები მხარდაჭერილი არაა
ru: Произвольные скорости передачи данных в бодах не поддерживаются

source: Control signals read set signals
ka: წაკითხულია მმართველი სიგნალი სიგნალების დაყენება

source: DTR write
ka: DTR ჩაწერილია
ru: DTR записан

source: RTS write
ka: RTS ჩაწერილია
ru: RTS записан

source: Control signals read lis_sig
ka: მიღებულია საკონტროლო სიგნალი lis_sig

source: No open port
ka: ღია პორტის გარეშე
ru: Порт не открыт

source: No serial devices found! Searched the following device path patterns: /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/ttyACM* /dev/usb/tts/* Enter a different device path in the 'Port' box.
ka: სერიული მოწყობილობები აღმოჩენილი არაა მოიძებნა შემდეგი მოწყობილობის ბილიკის ნიმუშები: /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/ttyACM* /dev/usb/tts/* შეიყვანეთ სხვა მოწყობილობის ბილიკი ველში 'პორტი'.

source: Configuration
ka: მორგება
ru: Настройка

source: Serial port
ka: სერიული პორტი
ru: Последовательный порт

source: Port:
ka: პორტი:
ru: Порт:

source: Baud Rate:
ka: ბოდების სიჩქარე:
ru: Скорость в бодах:

source: Parity:
ka: პარიტეტი:
ru: Проверка чётности:

source: Bits:
ka: ბიტი:
ru: Биты:

source: Stopbits:
ka: სტოპბიტები:
ru: Стоп-биты:

source: Flow control:
ka: დინების კონტროლი:
ru: Управление потоком:

source: Advanced Configuration Options
ka: დამატებითი პარამეტრები
ru: Расширенные параметры конфигурации

source: ASCII file transfer
ka: ASCII ფაილის გაგზავნა
ru: Передача ASCII-файла

source: End of line delay (milliseconds):
ka: ხაზის დასრულების დაყოვნება (მწმ):
ru: Задержка конца строки, мс:

source: Wait for this special character before passing to next line:
ka: ამ სპეციალური სიმბოლოს ლოდინი შემდეგ ხაზზე გადასვლამდე:
ru: Ожидать специальный символ до перехода к следующей строки:

source: RS-485 half-duplex parameters (RTS signal used to send)
ka: RS-485-ის ნახევარდუპლექსის პარამეტრები (გასაგზავნად გამოიყენება RTS-ის სიგნალი)
ru: Параметры полудуплексного соединения RS-485 (для отправки используется сигнал RTS)

source: Time with RTS 'on' before transmit (milliseconds):
ka: დრო ჩართული RTS-ით გაგზავნამდე (მწმ):
ru: Время, когда RTS "включен" перед передачей (миллисекунды):

source: Time with RTS 'on' after transmit (milliseconds):
ka: დრო ჩართული RTS-ით გაგზავნის შემდეგ (მწმ):
ru: Время, когда RTS "включен" после передачи (миллисекунды):

source: OK
ka: დიახ

source: Load configuration
ka: კონფიგურაციის ჩატვირთვა
ru: Загрузить настройку

source: Delete configuration
ka: კონფიგურაციის წაშლა
ru: Удалить настройку

source: Cannot read configuration file! Config file may contain invalid parameter.
ka: კონფიგურაციის ფაილის წაკითხვა შეუძლებელია! კონფიგურაციის ფაილი, შეიძლება, არასწორ პარამეტრს შეიცავდეს.
ru: Не удается прочитать конфигурационный файл! Возможно, конфигурационный файл содержит недопустимый параметр.

source: Configurations
ka: კონფიგურაციები
ru: Настройки

source: Save configuration
ka: კონფიგურაციი შენახვა
ru: Сохранить настройку

source: Configuration name:
ka: კონფიგურაციის სახელი:
ru: Название конфигурации:

source: Cannot save configuration file! Config file may contain invalid parameter.
ka: კონფიგურაციის ფაილის შენახვა შეუძლებელია! კონფიგურაციის ფაილი, შეიძლება, არასწორ პარამეტრს შეიცავდეს.
ru: Не удается сохранить конфигурационный файл! Возможно, конфигурационный файл содержит недопустимый параметр.

source: Cannot overwrite section!
ka: სექციის თავზე გადაწერა შეუძლებელია!
ru: Не удается перезаписать секцию!

source: Cannot read configuration file!
ka: კონფიგურაციის ფაილის წაკითხვა შეუძლებელია!
ru: Не удается прочитать конфигурационный файл!

source: Configuration [%s] saved
ka: კონფიგურაცია [%s] შენახულია
ru: Настройка [%s] сохранена

source: Cannot write configuration file! Config file may contain invalid parameter.
ka: კონფიგურაციის ფაილის ჩაწერა შეუძლებელია! კონფიგურაციის ფაილი, შეიძლება, არასწორ პარამეტრს შეიცავდეს.
ru: Не удается записать конфигурационный файл! Возможно, конфигурационный файл содержит недопустимый параметр.

source: <b>Section [%s] already exists.</b> Do you want to overwrite it ?
ka: <b>სექცია [%s] უკვე არსებობს.</b> გნებავთ მისი თავზე გადაწერა ?
ru: <b>Секция [%s] уже существует.</b> Хотите перезаписать его?

source: Cannot delete section!
ka: სექციის წაშლა შეუძლებელია!
ru: Невозможно удалить секцию!

source: No section "%s" in configuration file
ka: კონფიგურაციის ფაილში სექცია "%s" არ არსებობს
ru: Раздела "%s" нет в файле настроек

source: Baudrate %d may not be supported by all hardware
ka: ბოდური სიჩქარე %d შეიძლება, ყველა აპარატურის მიერ მხარდაჭერილი არ იყოს
ru: Скорость в бодах %d может поддерживаться не всеми аппаратными средствами

source: Invalid number of stop-bits: %d Falling back to default number of stop-bits number: %d
ka: სტოპბიტების არასწორი რაოდენობა: %d გადავერთვები სტოპბიტების ნაგულისხმევ რაოდენობაზე: %d
ru: Невозможное количество стоп-бит: %d Используется количество стоп-бит по умолчанию: %d

source: Invalid number of bits: %d Falling back to default number of bits: %d
ka: ბიტების არასწორი რაოდენობა: %d გადავერთვები ბიტების ნაგულისხმევ რაოდენობაზე: %d
ru: Невозможное количество бит: %d Используется количество бит по умолчанию: %d

source: Invalid delay: %d ms Falling back to default delay: %d ms
ka: არასწორი დაყოვნება: %d მწმ გადავერთვები ნაგულისხმევ დაყოვნებაზე: %d მწმ
ru: Невозможная задержка: %d мс Используется задержка по умолчанию: %d мс

source: Configuration file (%s) with [default] configuration has been created.
ka: შეიქმნა კონფიგურაციის ფაილი (%s) [ნაგულისხმევი] კონფიგურაციით.
ru: Создан файл настроек (%s) с настройкой по умолчанию [default].

source: Cannot find section %s
ka: ვერ ვიპოვე სექცია %s
ru: Невозможно найти раздел %s

source: Main Window
ka: მთავარი ფანჯარა
ru: Главное окно

source: Control signals read
ru: Получен управляющий сигнал

source: No serial devices found! Searched the following device path patterns: /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/usb/tts/* Enter a different device path in the 'Port' box.
ru: Устройство последовательного порта не найдено! Должно быть хотя бы одно из следующих: /dev/ttyS* /dev/tts/* /dev/ttyUSB* /dev/usb/tts/*
